YangQwQ/Stm32VisionSenseCar/Stm32-Vision/src/net/app_httpd.cpp
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#include "esp_http_server.h"
#include "esp_timer.h"
#include "esp_camera.h"
#include "img_converters.h"
#include "fb_gfx.h"
#include "esp32-hal-ledc.h"
#include "sdkconfig.h"
#include "lwip/sockets.h"
#include "src/cam/camera_index.h"
// lwip 的 inet.h 把 INADDR_NONE/IPADDR_NONE 定义为宏，而 Arduino core 的 IPAddress.h
// 声明同名全局对象（extern const IPAddress INADDR_NONE），宏会在声明处展开破坏语法；
// lwip 为预编译库，此处撤销宏不影响其编译期使用。
#undef INADDR_NONE
#undef IPADDR_NONE

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#endif

// 板载人脸检测/识别已关闭：其依赖 Espressif esp-face 的模型头文件，
// 且本项目视觉识别交由云端多模态大模型完成，板载人脸检测非必需。
// 若日后需要启用：引入 espressif/esp-face 模型头文件后，将下面两宏置 1 即可。
#define CONFIG_ESP_FACE_DETECT_ENABLED 0
#define CONFIG_ESP_FACE_RECOGNITION_ENABLED 0

#if CONFIG_ESP_FACE_DETECT_ENABLED

#include <vector>
#include "human_face_detect_msr01.hpp"
#include "human_face_detect_mnp01.hpp"

#define TWO_STAGE 1 /*<! 1: detect by two-stage which is more accurate but slower(with keypoints). */
                    /*<! 0: detect by one-stage which is less accurate but faster(without keypoints). */

#if CONFIG_ESP_FACE_RECOGNITION_ENABLED
#include "face_recognition_tool.hpp"
#include "face_recognition_112_v1_s16.hpp"
#include "face_recognition_112_v1_s8.hpp"

#define QUANT_TYPE 0 //if set to 1 => very large firmware, very slow, reboots when streaming...

#define FACE_ID_SAVE_NUMBER 7
#endif

#define FACE_COLOR_WHITE 0x00FFFFFF
#define FACE_COLOR_BLACK 0x00000000
#define FACE_COLOR_RED 0x000000FF
#define FACE_COLOR_GREEN 0x0000FF00
#define FACE_COLOR_BLUE 0x00FF0000
#define FACE_COLOR_YELLOW (FACE_COLOR_RED | FACE_COLOR_GREEN)
#define FACE_COLOR_CYAN (FACE_COLOR_BLUE | FACE_COLOR_GREEN)
#define FACE_COLOR_PURPLE (FACE_COLOR_BLUE | FACE_COLOR_RED)
#endif

// Enable LED FLASH setting
#define CONFIG_LED_ILLUMINATOR_ENABLED 1

// LED FLASH setup
#if CONFIG_LED_ILLUMINATOR_ENABLED

#define CONFIG_LED_MAX_INTENSITY 255

int led_duty = 0;
bool isStreaming = false;
static uint8_t s_led_pin = 0;  // core 3.x LEDC 改引脚式 API，不再手动分 channel（与摄像头 timer 冲突由驱动内部处理）

#endif

typedef struct
{
    httpd_req_t *req;
    size_t len;
} jpg_chunking_t;

#define PART_BOUNDARY "123456789000000000000987654321"
static const char *_STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char *_STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char *_STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\nX-Timestamp: %d.%06d\r\n\r\n";

httpd_handle_t stream_httpd = NULL;
httpd_handle_t camera_httpd = NULL;

// 连接建立后关 Nagle（指令/结果小报文低延迟）。
// 图传帧已改走 UDP，WS 不再承载大帧，故发送缓冲不再放大；
// 之前 64KB 的 SO_SNDBUF 会吃掉内部 RAM 连续块，反而挤占 ai_client 的 TLS 握手堆。
static void tune_socket(int fd)
{
    int sndbuf = 8 * 1024;
    lwip_setsockopt(fd, SOL_SOCKET, SO_SNDBUF, &sndbuf, sizeof(sndbuf));
    int nodelay = 1;
    lwip_setsockopt(fd, IPPROTO_TCP, TCP_NODELAY, &nodelay, sizeof(nodelay));
}

#ifdef CONFIG_HTTPD_WS_SUPPORT
// =================== WebSocket（端口 81 根路径，手机 App WSCarClient 通道） ===================
#include "ArduinoJson.h"
#include "src/cam/camera.h"
#include "src/core/command.h"
#include "src/net/ble.h"
#include "src/ai/ai_client.h"
#include "src/exec/direct_exec.h"
#include "src/core/board_log.h"

#define WS_STREAM_FPS 10
#define WS_EDIT_IMG_MAX (128 * 1024)  // 编辑图（二进制上行）上限，与 ai_client 一致

// WS 对端（手机）活体探测：连续此时间无任何上行 → 发一次探测 ping；再此时间无响应判死。
// 用于感知"静默断链"（如手机重启），恢复 BLE 广播供再次配网/兜底。探测基于应用层
// {"type":"ping"}，对端协议栈/客户端回 {"type":"pong"}，均走 WS 文本帧，无附加心跳。
// 手机侧空闲 3s 会主动发 ping（上行），故这里的 idle 阈值只要 >3s 就不会误伤健康客户端；
static const uint32_t WS_IDLE_PING_MS = 6000;     // 连续无上行时长，达到则发探测
static const uint32_t WS_PING_TIMEOUT_MS = 2500;  // 探测后可容忍的无上行时长（判死界）
static volatile uint32_t s_ws_last_rx_ms = 0;      // 最近收到任一 WS 文本/binary 上行（ms）
static volatile bool s_ws_ping_pending = false;    // 已发探测、等 pong（由 httpd 任务写入）
static uint32_t s_ws_ping_at_ms = 0;
static bool s_ws_had_client = false;               // WS 客户端曾经在位（有→无即判离线）

// httpd 活跃 fd 表上限，须 >= 服务器 max_open_sockets（给足余量，过长时跳过）
#define WS_MAX_CLIENTS 32

// =================== UDP 图传（手机 App UDPVideoClient 接收端） ===================
// 图传视频帧改用 UDP 承载，替代 WS 的 TCP 推流：规避 TCP 慢启动/Nagle/重传引发的
// 延迟时高时低。指令/状态仍走 WS（控制面，低带宽可靠通道）。
// 握手：手机绑定本地 UDP 端口并上报本机 IP，随 WS 的 stream on 指令发(udp_port, src_ip)；
// 板据此建立 UDP 会话（同网段，无 NAT）。整帧 JPEG 切成 ≤UDP_JPG_CHUNK 的分片推送。
#define UDP_JPG_CHUNK 1400     // 每数据报 JPEG 分片负载（留 MTU 余量，避免 IP 分片）
#define UDP_FRAME_HDR 14       // 分片头固定字节：magic(2) frame_id(4) seq(2) count(2) total(4) 全大端
#define UDP_MAGIC0 0x56
#define UDP_MAGIC1 0x44
static int s_udp_fd = -1;                    // UDP 会话 fd（懒创建）
static volatile bool s_udp_peer_valid = false; // 已注册手机 UDP 对端
static struct sockaddr_in s_udp_peer;        // 目标：手机 IP:udp_port（WS 处理任务写、推流任务读）
static uint32_t s_udp_frame_id = 0;          // 帧序号，接收端按它区分新旧帧

// 建立/更新 UDP 对端：ip_s_addr 为网络字节序、port 为主机序（内部 htons）。懒创建非阻塞 socket（缓冲满即跳帧）。
static void udp_peer_set(uint32_t ip_s_addr, uint16_t port) {
    if (s_udp_fd < 0) {
        s_udp_fd = lwip_socket(AF_INET, SOCK_DGRAM, IPPROTO_UDP);
        if (s_udp_fd < 0) { log_e("UDP socket fail"); return; }
        int nb = 1;
        lwip_fcntl(s_udp_fd, F_SETFL, O_NONBLOCK);  // 非阻塞：发送缓冲满即本次 hop 失败、整帧跳过
    }
    memset(&s_udp_peer, 0, sizeof(s_udp_peer));
    s_udp_peer.sin_family = AF_INET;
    s_udp_peer.sin_addr.s_addr = ip_s_addr;
    s_udp_peer.sin_port = htons(port);
    s_udp_peer_valid = true;
}

static void udp_peer_clear(void) {
    s_udp_peer_valid = false;
}

// 把一帧 JPEG 切成 UDP 分片推给对端；任一分片发送失败（缓冲满/对端不可达）即整帧放弃
// （快于降帧率，契合"同步发送+跳帧"控制策略，避免积压抬延迟）。
static void udp_send_frame(camera_fb_t *fb) {
    if (!s_udp_peer_valid || s_udp_fd < 0) return;
    size_t total = fb->len;
    if (total == 0) return;
    uint32_t fid = s_udp_frame_id++;
    uint16_t count = (uint16_t)((total + UDP_JPG_CHUNK - 1) / UDP_JPG_CHUNK);
    uint8_t hdr[UDP_FRAME_HDR];
    uint8_t buf[UDP_JPG_CHUNK + UDP_FRAME_HDR];
    const uint8_t *p = fb->buf;
    size_t rem = total;
    for (uint16_t seq = 0; seq < count; seq++) {
        size_t chunk = rem > UDP_JPG_CHUNK ? UDP_JPG_CHUNK : rem;
        hdr[0] = UDP_MAGIC0; hdr[1] = UDP_MAGIC1;
        hdr[2] = (uint8_t)(fid >> 24); hdr[3] = (uint8_t)(fid >> 16);
        hdr[4] = (uint8_t)(fid >> 8);  hdr[5] = (uint8_t)(fid);
        hdr[6] = (uint8_t)(seq >> 8);  hdr[7] = (uint8_t)(seq);
        hdr[8] = (uint8_t)(count >> 8); hdr[9] = (uint8_t)(count);
        hdr[10] = (uint8_t)(total >> 24); hdr[11] = (uint8_t)(total >> 16);
        hdr[12] = (uint8_t)(total >> 8);  hdr[13] = (uint8_t)(total);
        memcpy(buf, hdr, UDP_FRAME_HDR);
        memcpy(buf + UDP_FRAME_HDR, p, chunk);
        if (lwip_sendto(s_udp_fd, buf, UDP_FRAME_HDR + chunk, 0,
                        (struct sockaddr *)&s_udp_peer, sizeof(s_udp_peer)) < 0) {
            break;  // 非阻塞返回错误 = 队列满/对端不可达，废弃本帧
        }
        p += chunk;
        rem -= chunk;
    }
}

// 全量 WS fd 探测/踢除辅助：httpd 仅暴露活跃 fd 表，无 per-fd 状态管理，故按需遍历。
static esp_err_t ws_send_text(int fd, const char *text);  // 前向声明（定义在下方）
static void ws_ping_all(void) {
    int fds[WS_MAX_CLIENTS]; size_t n = WS_MAX_CLIENTS;
    if (httpd_get_client_list(stream_httpd, &n, fds) != ESP_OK) return;
    for (size_t i = 0; i < n; i++) {
        if (httpd_ws_get_fd_info(stream_httpd, fds[i]) != HTTPD_WS_CLIENT_WEBSOCKET) continue;
        ws_send_text(fds[i], "{\"type\":\"ping\"}");  // 探测帧，对端回 pong
    }
}

static void ws_kick_all(void) {
    int fds[WS_MAX_CLIENTS]; size_t n = WS_MAX_CLIENTS;
    if (httpd_get_client_list(stream_httpd, &n, fds) != ESP_OK) return;
    for (size_t i = 0; i < n; i++) {
        if (httpd_ws_get_fd_info(stream_httpd, fds[i]) != HTTPD_WS_CLIENT_WEBSOCKET) continue;
        httpd_sess_trigger_close(stream_httpd, fds[i]);  // 关闭死 fd，下轮剔出 client list
    }
}

static esp_err_t ws_send_text(int fd, const char *text)
{
    httpd_ws_frame_t frame = {0};
    frame.type = HTTPD_WS_TYPE_TEXT;
    frame.payload = (uint8_t *)text;
    frame.len = strlen(text);
    return httpd_ws_send_frame_async(stream_httpd, fd, &frame);
}

static esp_err_t ws_send_jpeg(int fd, camera_fb_t *fb)
{
    httpd_ws_frame_t frame = {0};
    frame.type = HTTPD_WS_TYPE_BINARY;
    frame.payload = fb->buf;
    frame.len = fb->len;
    return httpd_ws_send_frame_async(stream_httpd, fd, &frame);
}

